/*

测试文件说明，该文件用于测试2位超前进位加法器的功能正确性

*/

`timescale 1ns / 1ps
//****************************************VSCODE PLUG-IN**********************************// 
//---------------------------------------------------------------------------------------- 
// IDE :                   VSCODE      
// VSCODE plug-in version: Verilog-Hdl-Format-3.6.20250614
// VSCODE plug-in author : Jiang Percy 
//---------------------------------------------------------------------------------------- 
//****************************************Copyright (c)***********************************// 
// Copyright(C)            COMPANY_NAME
// All rights reserved      
// File name:               
// Last modified Date:     2026/03/18 17:17:59 
// Last Version:           V1.0 
// Descriptions:            
//---------------------------------------------------------------------------------------- 
// Created by:             USER_NAME
// Created date:           2026/03/18 17:17:59 
// Version:                V1.0 
// TEXT NAME:              cla2bit_tb.v 
// PATH:                   E:\electronic2\project\verilog_pro\TPU_vivado\TPU_project\src\sim\cla2bit_tb.v 
// Descriptions:            
//                          
//---------------------------------------------------------------------------------------- 
//****************************************************************************************// 



module cla2bit_tb;

  /******************************* 参数 ***********************************/


  /******************************* reg信号 ***********************************/
  reg [1:0] a;
  reg [1:0] b;
  reg cin;
  reg clk;

  /******************************* 网表信号 ***********************************/
  wire [1:0] s;
  wire cout;
  wire mismatch;
  wire [2:0] gold_result;

  /******************************* 仿真过程 ***********************************/
  initial begin
    clk = 0;

    #1000 $stop;
  end

  /******************************* 组合逻辑 ***********************************/
  assign gold_result = a + b + cin;
  assign mismatch = gold_result ^ {cout, s};

  /******************************* 时序逻辑 ***********************************/
  always #5 clk = ~clk;
  always @(posedge clk) begin
    a   <= $urandom_range(3, 0);
    b   <= $urandom_range(3, 0);
    cin <= $urandom_range(1, 0);
  end

  /******************************* 模块例化 ***********************************/
  cla_2bit cla_2bit_inst (
      .a(a),
      .b(b),
      .cin(cin),
      .s(s),
      .cout(cout)
  );

endmodule
